In [50]:
import pandas as pd

In [51]:
df = pd.read_csv('un-emp.csv')
df.head()

,FIPS,State,Year,Month,Employable Population,Employed,Unemployed
0,1,Alabama,1976,1,"1,492,409","1,392,154","100,255"
1,2,Alaska,1976,1,"159,154","147,809","11,345"
2,4,Arizona,1976,1,"972,413","872,738","99,675"
3,5,Arkansas,1976,1,"882,835","817,756","65,079"
4,6,California,1976,1,"9,781,720","8,892,663","889,057"

In [52]:
df.drop(columns = ['FIPS', 'Employable Population'], inplace = True)
df.columns

Index(['State', 'Year', 'Month', 'Employed', 'Unemployed'], dtype='object')

In [53]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 27387 entries, 0 to 27386
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   State       27387 non-null  object
 1   Year        27387 non-null  int64
 2   Month       27387 non-null  int64
 3   Employed    27387 non-null  object
 4   Unemployed  27387 non-null  object
dtypes: int64(2), object(3)
memory usage: 1.0+ MB

In [54]:
df.shape

(27387, 5)

In [55]:
df.isna().sum()

State         0
Year          0
Month         0
Employed      0
Unemployed    0
dtype: int64

#### Turn Employement and Unemployement columns into numeric type. The problem is each number is a string with empty spaces at the end like such: '1,392,154_ _'

In [56]:
#code from: https://pretagteam.com/question/apply-strip-a-column-in-pandas

df[['Employed']] = df['Employed'].apply(lambda x: x.rstrip())
df[['Unemployed']] = df['Unemployed'].apply(lambda x: x.rstrip())

# Looking for unique values in object type columns
for column in df:
    print(f'{column} : {sorted(list(df[column].unique()), reverse = True)[0:3]}')

State : ['Wyoming', 'Wisconsin', 'West Virginia']
Year : [2020, 2019, 2018]
Month : [12, 11, 10]
Employed : ['999,943', '999,512', '999,458']
Unemployed : ['999,867', '999,827', '999,785']

In [57]:
# Stripping commas so I can convert into numeric type

df[['Employed']] = df['Employed'].apply(lambda x: x.replace(',' , ''))
df[['Unemployed']] = df['Unemployed'].apply(lambda x: x.replace(',' , ''))

df.head()

        State  Year  Month Employed Unemployed
0     Alabama  1976      1  1392154     100255
1      Alaska  1976      1   147809      11345
2     Arizona  1976      1   872738      99675
3    Arkansas  1976      1   817756      65079
4  California  1976      1  8892663     889057

In [58]:
# convert string to an integer
df[['Employed']] = df['Employed'].astype(int)
df[['Unemployed']] = df['Unemployed'].astype(int)

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 27387 entries, 0 to 27386
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   State       27387 non-null  object
 1   Year        27387 non-null  int64
 2   Month       27387 non-null  int64
 3   Employed    27387 non-null  int64
 4   Unemployed  27387 non-null  int64
dtypes: int64(4), object(1)
memory usage: 1.0+ MB

In [59]:
df.to_csv('df_hans_employment.csv')